{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "45"}]}}}, "outputs": {"dense_35": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/dense_18/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_35/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_35/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "45"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_18/BiasAdd", "op": "_FusedMatMul", "input": ["input_2", "StatefulPartitionedCall/sequential_1/dense_18/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_18/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_18/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_18/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_18/Tanh", "StatefulPartitionedCall/sequential_1/dense_19/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_19/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_19/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_19/Tanh", "StatefulPartitionedCall/sequential_1/dense_20/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_20/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_20/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_20/Tanh", "StatefulPartitionedCall/sequential_1/dense_21/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_21/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_21/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_21/Tanh", "StatefulPartitionedCall/sequential_1/dense_22/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_22/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_22/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_22/Tanh", "StatefulPartitionedCall/sequential_1/dense_23/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_23/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_23/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_23/Tanh", "StatefulPartitionedCall/sequential_1/dense_24/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_24/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_24/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_24/Tanh", "StatefulPartitionedCall/sequential_1/dense_25/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_25/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_25/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_25/Tanh", "StatefulPartitionedCall/sequential_1/dense_26/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_26/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_26/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_26/Tanh", "StatefulPartitionedCall/sequential_1/dense_27/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_27/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_27/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_27/Tanh", "StatefulPartitionedCall/sequential_1/dense_28/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_28/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_28/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_28/Tanh", "StatefulPartitionedCall/sequential_1/dense_29/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_29/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_29/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_29/Tanh", "StatefulPartitionedCall/sequential_1/dense_30/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_30/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_30/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_30/Tanh", "StatefulPartitionedCall/sequential_1/dense_31/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_31/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_31/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_31/Tanh", "StatefulPartitionedCall/sequential_1/dense_32/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_32/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_32/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_32/Tanh", "StatefulPartitionedCall/sequential_1/dense_33/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_33/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_33/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_33/Tanh", "StatefulPartitionedCall/sequential_1/dense_34/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_34/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/dense_34/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_35/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_34/Tanh", "StatefulPartitionedCall/sequential_1/dense_35/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_35/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_35/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/dense_18/MatMul/ReadVariableOp", "shape": [45, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_18/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_19/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_20/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_21/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_22/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_23/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_24/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_25/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_26/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_27/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_28/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_29/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_30/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_31/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_32/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_33/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_34/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_35/MatMul/ReadVariableOp", "shape": [154, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_35/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}