{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_3": {"name": "input_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "45"}]}}}, "outputs": {"dense_53": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/dense_36/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_36/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_53/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_53/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "45"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_36/BiasAdd", "op": "_FusedMatMul", "input": ["input_3", "StatefulPartitionedCall/sequential_2/dense_36/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_36/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_36/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_36/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_36/Tanh", "StatefulPartitionedCall/sequential_2/dense_37/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_37/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_37/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_37/Tanh", "StatefulPartitionedCall/sequential_2/dense_38/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_38/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_38/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_38/Tanh", "StatefulPartitionedCall/sequential_2/dense_39/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_39/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_39/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_39/Tanh", "StatefulPartitionedCall/sequential_2/dense_40/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_40/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_40/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_40/Tanh", "StatefulPartitionedCall/sequential_2/dense_41/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_41/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_41/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_41/Tanh", "StatefulPartitionedCall/sequential_2/dense_42/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_42/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_42/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_42/Tanh", "StatefulPartitionedCall/sequential_2/dense_43/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_43/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_43/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_43/Tanh", "StatefulPartitionedCall/sequential_2/dense_44/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_44/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_44/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_44/Tanh", "StatefulPartitionedCall/sequential_2/dense_45/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_45/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_45/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_45/Tanh", "StatefulPartitionedCall/sequential_2/dense_46/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_46/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_46/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_46/Tanh", "StatefulPartitionedCall/sequential_2/dense_47/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_47/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_47/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_47/Tanh", "StatefulPartitionedCall/sequential_2/dense_48/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_48/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_48/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_48/Tanh", "StatefulPartitionedCall/sequential_2/dense_49/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_49/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_49/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_49/Tanh", "StatefulPartitionedCall/sequential_2/dense_50/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_50/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_50/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_50/Tanh", "StatefulPartitionedCall/sequential_2/dense_51/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_51/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_51/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_51/Tanh", "StatefulPartitionedCall/sequential_2/dense_52/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_52/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2/dense_52/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_53/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_52/Tanh", "StatefulPartitionedCall/sequential_2/dense_53/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_2/dense_53/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_53/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/dense_36/MatMul/ReadVariableOp", "shape": [45, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_36/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_37/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_38/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_39/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_40/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_41/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_42/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_43/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_44/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_45/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_46/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_47/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_48/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_49/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_50/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_51/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_52/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_53/MatMul/ReadVariableOp", "shape": [154, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2/dense_53/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}