{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_4": {"name": "input_4:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "54"}]}}}, "outputs": {"dense_71": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_3/dense_54/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "54"}, {"size": "213"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_54/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "213"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "213"}, {"size": "127"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "127"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "127"}, {"size": "109"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "109"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "109"}, {"size": "232"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "232"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "150"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "74"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}, {"size": "172"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "172"}, {"size": "102"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "102"}, {"size": "74"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "74"}, {"size": "93"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "93"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "93"}, {"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "150"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "91"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "91"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "91"}, {"size": "103"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "103"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "103"}, {"size": "171"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "171"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "171"}, {"size": "239"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "239"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_71/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "239"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_71/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_4", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "54"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_54/BiasAdd", "op": "_FusedMatMul", "input": ["input_4", "StatefulPartitionedCall/sequential_3/dense_54/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_54/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_54/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_54/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_54/Tanh", "StatefulPartitionedCall/sequential_3/dense_55/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_55/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_55/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_55/Tanh", "StatefulPartitionedCall/sequential_3/dense_56/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_56/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_56/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_56/Tanh", "StatefulPartitionedCall/sequential_3/dense_57/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_57/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_57/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_57/Tanh", "StatefulPartitionedCall/sequential_3/dense_58/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_58/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_58/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_58/Tanh", "StatefulPartitionedCall/sequential_3/dense_59/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_59/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_59/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_59/Tanh", "StatefulPartitionedCall/sequential_3/dense_60/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_60/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_60/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_60/Tanh", "StatefulPartitionedCall/sequential_3/dense_61/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_61/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_61/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_61/Tanh", "StatefulPartitionedCall/sequential_3/dense_62/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_62/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_62/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_62/Tanh", "StatefulPartitionedCall/sequential_3/dense_63/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_63/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_63/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_63/Tanh", "StatefulPartitionedCall/sequential_3/dense_64/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_64/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_64/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_64/Tanh", "StatefulPartitionedCall/sequential_3/dense_65/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_65/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_65/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_65/Tanh", "StatefulPartitionedCall/sequential_3/dense_66/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_66/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_66/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_66/Tanh", "StatefulPartitionedCall/sequential_3/dense_67/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_67/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_67/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_67/Tanh", "StatefulPartitionedCall/sequential_3/dense_68/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_68/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_68/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_68/Tanh", "StatefulPartitionedCall/sequential_3/dense_69/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_69/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_69/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_69/Tanh", "StatefulPartitionedCall/sequential_3/dense_70/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_70/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_3/dense_70/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_3/dense_71/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_3/dense_70/Tanh", "StatefulPartitionedCall/sequential_3/dense_71/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_3/dense_71/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_3/dense_71/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_3/dense_54/MatMul/ReadVariableOp", "shape": [54, 213], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_54/BiasAdd/ReadVariableOp", "shape": [213], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/MatMul/ReadVariableOp", "shape": [213, 127], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_55/BiasAdd/ReadVariableOp", "shape": [127], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/MatMul/ReadVariableOp", "shape": [127, 109], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_56/BiasAdd/ReadVariableOp", "shape": [109], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/MatMul/ReadVariableOp", "shape": [109, 232], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_57/BiasAdd/ReadVariableOp", "shape": [232], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/MatMul/ReadVariableOp", "shape": [232, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_58/BiasAdd/ReadVariableOp", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/MatMul/ReadVariableOp", "shape": [192, 150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_59/BiasAdd/ReadVariableOp", "shape": [150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/MatMul/ReadVariableOp", "shape": [150, 74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_60/BiasAdd/ReadVariableOp", "shape": [74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/MatMul/ReadVariableOp", "shape": [74, 172], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_61/BiasAdd/ReadVariableOp", "shape": [172], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/MatMul/ReadVariableOp", "shape": [172, 102], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_62/BiasAdd/ReadVariableOp", "shape": [102], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/MatMul/ReadVariableOp", "shape": [102, 74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_63/BiasAdd/ReadVariableOp", "shape": [74], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/MatMul/ReadVariableOp", "shape": [74, 93], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_64/BiasAdd/ReadVariableOp", "shape": [93], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/MatMul/ReadVariableOp", "shape": [93, 160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_65/BiasAdd/ReadVariableOp", "shape": [160], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/MatMul/ReadVariableOp", "shape": [160, 150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_66/BiasAdd/ReadVariableOp", "shape": [150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/MatMul/ReadVariableOp", "shape": [150, 91], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_67/BiasAdd/ReadVariableOp", "shape": [91], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/MatMul/ReadVariableOp", "shape": [91, 103], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_68/BiasAdd/ReadVariableOp", "shape": [103], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/MatMul/ReadVariableOp", "shape": [103, 171], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_69/BiasAdd/ReadVariableOp", "shape": [171], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/MatMul/ReadVariableOp", "shape": [171, 239], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_70/BiasAdd/ReadVariableOp", "shape": [239], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_71/MatMul/ReadVariableOp", "shape": [239, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_3/dense_71/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}