{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_5": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "45"}]}}}, "outputs": {"dense_89": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_4/dense_72/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_72/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_89/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_89/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_5", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "45"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_72/BiasAdd", "op": "_FusedMatMul", "input": ["input_5", "StatefulPartitionedCall/sequential_4/dense_72/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_72/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_72/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_72/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_72/Tanh", "StatefulPartitionedCall/sequential_4/dense_73/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_73/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_73/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_73/Tanh", "StatefulPartitionedCall/sequential_4/dense_74/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_74/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_74/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_74/Tanh", "StatefulPartitionedCall/sequential_4/dense_75/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_75/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_75/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_75/Tanh", "StatefulPartitionedCall/sequential_4/dense_76/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_76/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_76/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_76/Tanh", "StatefulPartitionedCall/sequential_4/dense_77/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_77/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_77/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_77/Tanh", "StatefulPartitionedCall/sequential_4/dense_78/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_78/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_78/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_78/Tanh", "StatefulPartitionedCall/sequential_4/dense_79/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_79/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_79/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_79/Tanh", "StatefulPartitionedCall/sequential_4/dense_80/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_80/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_80/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_80/Tanh", "StatefulPartitionedCall/sequential_4/dense_81/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_81/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_81/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_81/Tanh", "StatefulPartitionedCall/sequential_4/dense_82/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_82/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_82/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_82/Tanh", "StatefulPartitionedCall/sequential_4/dense_83/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_83/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_83/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_83/Tanh", "StatefulPartitionedCall/sequential_4/dense_84/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_84/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_84/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_84/Tanh", "StatefulPartitionedCall/sequential_4/dense_85/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_85/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_85/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_85/Tanh", "StatefulPartitionedCall/sequential_4/dense_86/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_86/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_86/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_86/Tanh", "StatefulPartitionedCall/sequential_4/dense_87/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_87/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_87/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_87/Tanh", "StatefulPartitionedCall/sequential_4/dense_88/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_88/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_4/dense_88/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_4/dense_89/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_4/dense_88/Tanh", "StatefulPartitionedCall/sequential_4/dense_89/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_4/dense_89/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_4/dense_89/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_4/dense_72/MatMul/ReadVariableOp", "shape": [45, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_72/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_73/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_74/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_75/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_76/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_77/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_78/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_79/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_80/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_81/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_82/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_83/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_84/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_85/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_86/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_87/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_88/BiasAdd/ReadVariableOp", "shape": [154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_89/MatMul/ReadVariableOp", "shape": [154, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_4/dense_89/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}