{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}, {"size": "9"}]}}}, "outputs": {"transformer_encoder_regressor_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_49/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/dense_50/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/batch_normalization_39/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/batch_normalization_39/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/batch_normalization_38/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/batch_normalization_38/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/multi_head_attention_19/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/multi_head_attention_19/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/multi_head_attention_19/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/multi_head_attention_19/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_19/multi_head_attention_19/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_47/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/dense_48/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/batch_normalization_37/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/batch_normalization_37/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/batch_normalization_36/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/batch_normalization_36/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/multi_head_attention_18/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/multi_head_attention_18/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/multi_head_attention_18/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/multi_head_attention_18/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_18/multi_head_attention_18/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_45/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/dense_46/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/batch_normalization_35/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/batch_normalization_35/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/batch_normalization_34/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/batch_normalization_34/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/multi_head_attention_17/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/multi_head_attention_17/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/multi_head_attention_17/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/multi_head_attention_17/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_17/multi_head_attention_17/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_43/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/dense_44/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/batch_normalization_33/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/batch_normalization_33/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/batch_normalization_32/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/batch_normalization_32/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/multi_head_attention_16/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/multi_head_attention_16/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/multi_head_attention_16/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/multi_head_attention_16/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_16/multi_head_attention_16/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_41/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/dense_42/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/batch_normalization_31/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/batch_normalization_31/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/batch_normalization_30/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/batch_normalization_30/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/multi_head_attention_15/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/multi_head_attention_15/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/multi_head_attention_15/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/transformer_encoder_regressor_1/transformer_batch_norm_encoder_block_1/sequential_2/transformer_batch_norm_encoder_layer_15/multi_head_attention_15/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": 