{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "45"}]}}}, "outputs": {"dense_17": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "45"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_10/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_11/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_12/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_13/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_14/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_15/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "154"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_17/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "154"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "45"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul", "op": "MatMul", "input": ["input_1", "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense/Tanh", "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_1/Tanh", "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_2/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_2/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_2/Tanh", "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_3/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_3/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_4/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_3/Tanh", "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_4/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_4/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_5/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_4/Tanh", "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_5/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_5/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_6/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_5/Tanh", "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_6/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_6/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_7/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_6/Tanh", "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_7/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_7/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_8/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_7/Tanh", "StatefulPartitionedCall/sequential/dense_8/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_8/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_8/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_9/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_8/Tanh", "StatefulPartitionedCall/sequential/dense_9/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_9/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_9/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_10/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_9/Tanh", "StatefulPartitionedCall/sequential/dense_10/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_10/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_10/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_11/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_10/Tanh", "StatefulPartitionedCall/sequential/dense_11/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_11/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_11/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_12/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_11/Tanh", "StatefulPartitionedCall/sequential/dense_12/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_12/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_12/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_13/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_12/Tanh", "StatefulPartitionedCall/sequential/dense_13/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_13/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_13/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_14/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_13/Tanh", "StatefulPartitionedCall/sequential/dense_14/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_14/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_14/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_15/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_14/Tanh", "StatefulPartitionedCall/sequential/dense_15/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_15/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_15/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_16/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_15/Tanh", "StatefulPartitionedCall/sequential/dense_16/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/dense_16/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential/dense_16/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_17/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential/dense_16/Tanh", "StatefulPartitionedCall/sequential/dense_17/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/dense_17/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "shape": [45, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_2/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_3/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_4/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_5/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_6/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_7/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_8/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_9/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_10/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_11/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_12/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_13/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_14/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_15/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_16/MatMul/ReadVariableOp", "shape": [154, 154], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/dense_17/MatMul/ReadVariableOp", "shape": [154, 2], "dtype": "float32"}]}]}