{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "13"}, {"size": "9"}]}}}, "outputs": {"transformer_encoder_regressor": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_19/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/dense_20/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/batch_normalization_19/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/batch_normalization_19/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/batch_normalization_18/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/batch_normalization_18/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/multi_head_attention_9/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/multi_head_attention_9/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/multi_head_attention_9/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/multi_head_attention_9/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_9/multi_head_attention_9/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/dense_18/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/batch_normalization_17/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/batch_normalization_17/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/batch_normalization_16/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/batch_normalization_16/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/multi_head_attention_8/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/multi_head_attention_8/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/multi_head_attention_8/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/multi_head_attention_8/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_8/multi_head_attention_8/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/dense_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/batch_normalization_15/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/batch_normalization_15/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/batch_normalization_14/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/batch_normalization_14/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/multi_head_attention_7/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/multi_head_attention_7/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/multi_head_attention_7/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/multi_head_attention_7/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_7/multi_head_attention_7/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/batch_normalization_13/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/batch_normalization_13/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/batch_normalization_12/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/batch_normalization_12/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/multi_head_attention_6/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/multi_head_attention_6/key/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/multi_head_attention_6/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/multi_head_attention_6/query/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_6/multi_head_attention_6/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/Tensordot/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/batch_normalization_11/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/batch_normalization_11/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/batch_normalization_10/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/batch_normalization_10/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/multi_head_attention_5/key/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/multi_head_attention_5/key/add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/multi_head_attention_5/query/einsum/Einsum/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "176"}, {"size": "4"}, {"size": "176"}]}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/multi_head_attention_5/query/add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "176"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_5/multi_head_attention_5/Mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_4/dense_10/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_4/dense_10/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/transformer_encoder_regressor/transformer_batch_norm_encoder_block/sequential/transformer_batch_norm_encoder_layer_4/dense_10/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": 