{"format": "graph-model", "generatedBy": "2.8.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_8": {"name": "input_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "9"}]}}}, "outputs": {"dense_92": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "191"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "191"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "191"}, {"size": "191"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_92/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "191"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_92/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/Shape", "op": "Shape", "input": ["input_8"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose", "op": "Transpose", "input": ["input_8", "StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/Shape", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose", "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice", "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/Shape_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/packed", "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/while/loop_counter", "StatefulPartitionedCall/sequential_7/simple_rnn_2/while/maximum_iterations", "StatefulPartitionedCall/sequential_7/simple_rnn_2/time", "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayUnstack/TensorListFromTensor", "unknown", "unknown_0", "unknown_1"], "attr": {"cond": {"func": {"name": "__inference_sequential_7_simple_rnn_2_while_cond_10232608_frozen_10236275"}}, "parallel_iterations": {"i": "32"}, "_stateful_parallelism": {"b": false}, "_lower_using_switch_merge": {"b": false}, "_read_only_resource_inputs": {"list": {"i": ["7", "8", "9"]}}, "body": {"func": {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274"}}, "_num_original_outputs": {"i": "10"}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "191"}]}, {}, {}, {"dim": [{"size": "9"}, {"size": "191"}]}, {"dim": [{"size": "191"}]}, {"dim": [{"size": "191"}, {"size": "191"}]}]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/while:3", "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_92/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3", "StatefulPartitionedCall/sequential_7/dense_92/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_92/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/dense_92/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_7_simple_rnn_2_while_cond_10232608_frozen_10236275", "inputArg": [{"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_less_sequential_7_simple_rnn_2_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_cond_10232608___redundant_placeholder0", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_cond_10232608___redundant_placeholder1", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_cond_10232608___redundant_placeholder2", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_cond_10232608___redundant_placeholder3", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_7_simple_rnn_2_while_identity", "type": "DT_BOOL"}]}, "nodeDef": [{"name": "sequential_7/simple_rnn_2/while/Less", "op": "Less", "input": ["sequential_7_simple_rnn_2_while_placeholder", "sequential_7_simple_rnn_2_while_less_sequential_7_simple_rnn_2_strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}], "ret": {"sequential_7_simple_rnn_2_while_identity": "sequential_7/simple_rnn_2/while/Less:z:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "argAttr": {"0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "191"}]}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{"unknownRank": true}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}}}, {"signature": {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274", "inputArg": [{"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_tensorarrayv2read_tensorlistgetitem_sequential_7_simple_rnn_2_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_biasadd_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_1_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_7_simple_rnn_2_while_identity", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_7_simple_rnn_2_while_tensorarrayv2read_tensorlistgetitem_sequential_7_simple_rnn_2_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_biasadd_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_1_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp", "op": "Identity", "input": ["sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_7_simple_rnn_2_while_simple_rnn_cell_2_biasadd_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp", "op": "Identity", "input": ["sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/add", "op": "AddV2", "input": ["sequential_7_simple_rnn_2_while_placeholder", "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/simple_rnn_2/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_7_simple_rnn_2_while_tensorarrayv2read_tensorlistgetitem_sequential_7_simple_rnn_2_tensorarrayunstack_tensorlistfromtensor_0", "sequential_7_simple_rnn_2_while_placeholder", "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/add_1", "op": "AddV2", "input": ["sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_loop_counter", "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1", "op": "MatMul", "input": ["sequential_7_simple_rnn_2_while_placeholder_2", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp:output:0"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/NoOp", "op": "NoOp", "input": ["^sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp", "^sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp", "^sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul", "op": "MatMul", "input": ["sequential_7/simple_rnn_2/while/TensorArrayV2Read/TensorListGetItem:item:0", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp:output:0"], "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/Identity_1", "op": "Identity", "input": ["sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_while_maximum_iterations", "^sequential_7/simple_rnn_2/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/simple_rnn_2/while/Identity_2", "op": "Identity", "input": ["sequential_7/simple_rnn_2/while/add:z:0", "^sequential_7/simple_rnn_2/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/simple_rnn_2/while/Identity", "op": "Identity", "input": ["sequential_7/simple_rnn_2/while/add_1:z:0", "^sequential_7/simple_rnn_2/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd", "op": "BiasAdd", "input": ["sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul:product:0", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/add", "op": "AddV2", "input": ["sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd:output:0", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1:product:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/Sigmoid", "op": "Sigmoid", "input": ["sequential_7/simple_rnn_2/while/simple_rnn_cell_2/add:z:0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["sequential_7_simple_rnn_2_while_placeholder_1", "sequential_7_simple_rnn_2_while_placeholder", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/Sigmoid:y:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}, {"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "sequential_7/simple_rnn_2/while/Identity_4", "op": "Identity", "input": ["sequential_7/simple_rnn_2/while/simple_rnn_cell_2/Sigmoid:y:0", "^sequential_7/simple_rnn_2/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/simple_rnn_2/while/Identity_3", "op": "Identity", "input": ["sequential_7/simple_rnn_2/while/TensorArrayV2Write/TensorListSetItem:output_handle:0", "^sequential_7/simple_rnn_2/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}], "ret": {"sequential_7_simple_rnn_2_while_identity_2": "sequential_7/simple_rnn_2/while/Identity_2:output:0", "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_biasadd_readvariableop_resource": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_biasadd_readvariableop_resource_0", "sequential_7_simple_rnn_2_while_identity_3": "sequential_7/simple_rnn_2/while/Identity_3:output:0", "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_strided_slice_1": "sequential_7_simple_rnn_2_while_sequential_7_simple_rnn_2_strided_slice_1_0", "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_readvariableop_resource": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_readvariableop_resource_0", "sequential_7_simple_rnn_2_while_tensorarrayv2read_tensorlistgetitem_sequential_7_simple_rnn_2_tensorarrayunstack_tensorlistfromtensor": "sequential_7_simple_rnn_2_while_tensorarrayv2read_tensorlistgetitem_sequential_7_simple_rnn_2_tensorarrayunstack_tensorlistfromtensor_0", "sequential_7_simple_rnn_2_while_identity_4": "sequential_7/simple_rnn_2/while/Identity_4:output:0", "sequential_7_simple_rnn_2_while_identity": "sequential_7/simple_rnn_2/while/Identity:output:0", "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_1_readvariableop_resource": "sequential_7_simple_rnn_2_while_simple_rnn_cell_2_matmul_1_readvariableop_resource_0", "sequential_7_simple_rnn_2_while_identity_1": "sequential_7/simple_rnn_2/while/Identity_1:output:0"}, "attr": {"_construction_context": {"s": "a0VhZ2VyUnVudGltZQ=="}}, "controlRet": {"sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul_1/ReadVariableOp", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/BiasAdd/ReadVariableOp", "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp": "sequential_7/simple_rnn_2/while/simple_rnn_cell_2/MatMul/ReadVariableOp"}, "argAttr": {"1": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "6": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "3": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "5": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "0": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "2": {"attr": {"_output_shapes": {"list": {"shape": [{}]}}}}, "4": {"attr": {"_output_shapes": {"list": {"shape": [{"dim": [{"size": "-1"}, {"size": "191"}]}]}}}}}}]}, "versions": {"producer": 987, "minConsumer": 12}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/while/maximum_iterations", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "unknown", "shape": [9, 191], "dtype": "float32"}, {"name": "unknown_0", "shape": [191], "dtype": "float32"}, {"name": "unknown_1", "shape": [191, 191], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/simple_rnn_2/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_92/MatMul/ReadVariableOp", "shape": [191, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_7/dense_92/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}, {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add/y", "shape": [], "dtype": "int32"}, {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], "dtype": "int32"}, {"name": "__inference_sequential_7_simple_rnn_2_while_body_10232609_frozen_10236274/sequential_7/simple_rnn_2/while/add_1/y", "shape": [], "dtype": "int32"}]}]}